//
//  Localizable.strings
//  Nextcloud
//
//  Copyright © 2017 Marino Faggiana. All rights reserved.
//
//  Author Marino Faggiana <marino.faggiana@nextcloud.com>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

"_cancel_"                  = "Peruuta";
"_edit_"                    = "Muokkaa";
"_tap_to_cancel_"           = "Napauta peruuttaaksesi";
"_tap_to_min_max_"          = "Tap to minimize / maximize";
"_cancel_request_"          = "Haluatko peruuttaa?";
"_upload_file_"             = "Lähetä tiedosto";
"_download_file_"           = "Lataa tiedosto";
"_delete_"                  = "Poista";
"_rename_"                  = "Nimeä uudelleen";
"_rename_file_"             = "Uudelleennimeä tiedosto";
"_rename_folder_"           = "Uudelleennimeä kansio";
"_move_"                    = "Siirrä";
"_add_"                     = "Lisää";
"_save_"                    = "Tallenna";
"_warning_"                 = "Varoitus";
"_error_"                   = "Virhe";
"_no_"                      = "Ei";
"_yes_"                     = "Kyllä";
"_select_"                  = "Valitse";
"_select_all_"              = "Valitse kaikki";
"_upload_"                  = "Upload";
"_home_"                    = "Tiedostot";
"_files_"                   = "Tiedostot";
"_ok_"                      = "OK";
"_done_"                    = "Valmis";
"_clear_"                   = "Tyhjennä";
"_selected_"                = "Valittu";
"_no_active_account_"       = "No account found";
"_info_"                    = "Tietoa";
"_warning_"                 = "Varoitus";
"_video_"                   = "Video";
"_overwrite_"               = "Ylikirjoita";
"_create_"                  = "Luo";
"_create_folder_"           = "Luo kansio";
"_create_folder_e2ee_"      = "Luo salattu kansio";
"_close_"                   = "Sulje";
"_remove_"                  = "Poista";
"_file_not_found_"          = "Tiedostoa ei löytynyt";
"_continue_"                = "Jatka";
"_continue_editing_"        = "Jatka muokkaamista";
"_auto_upload_folder_"      = "Automaattinen lähetys";
"_photo_"                   = "Kuva";
"_audio_"                   = "Ääni";
"_unknown_"                 = "Tuntematon";
"_success_"                 = "Onnistui";
"_mode_filename_"           = "Tiedostonimen tila";
"_warning_owncloud_"        = "You are connected to an ownCloud server. This is untested and unsupported, use at your own risk. To upgrade to Nextcloud, see https://nextcloud.com/migration.";
"_warning_unsupported_"     = "You are using an unsupported version of Nextcloud. For the safety of your data we strongly recommend updating to the latest stable Nextcloud.";
"_restore_"                 = "Palauta";
"_tap_here_to_change_"      = "Kosketa vaihtaaksesi";
"_no_albums_"               = "Ei albumeita";
"_denied_album_"            = "This app does not have access to \"Photos\". You can enable access in Privacy Settings.";
"_denied_camera_"           = "This app does not have access to the \"Camera\". You can enable access in Privacy Settings.";
"_force_start_"             = "Pakota käynnistys";
"_account_does_not_exist_"  = "The account %@ does not exist. Please log in again.";
"_sharing_"                 = "Jakaminen";
"_details_"                 = "Tiedot";
"_no_permission_add_file_"  = "You don't have permission to add files.";
"_no_permission_delete_file_" = "You don't have permission to delete files.";
"_no_permission_modify_file_" = "You don't have permission to modify files.";
"_no_permission_favorite_file_" = "You don't have permission to add the file to your favorites.";
"_add_folder_info_"         = "Lisää kansion info";
"_back_"                    = "Takaisin";
"_search_"                  = "Etsi";
"_search_or_create_tags"    = "Search or create tag";
"_tags_"                    = "Tags";
"_share_tags_create_"       = "Create \"%@\"";
"_share_tags_no_results_"   = "No tags found";
"_share_tags_added_named_"  = "Tag %@ has been created.";
"_edit_tags_"               = "Manage tags";
"_create_tag_error_"        = "New tag could not be created. Please try again.";
"_of_"                      = "/";
"_livephoto_save_"          = "Save Live Photo to Photo Album";
"_livephoto_save_error_"    = "Error during save of Live Photo.";
"_livephoto_no_"            = "Disable Live Photo";
"_convert_live_photo_"      = "Convert to Live Photo";
"_file_conflict_num_"       = "file conflict";
"_file_conflicts_num_"      = "file conflicts";
"_file_conflict_desc_"      = "Which files do you want to keep?\nIf you select both versions, the copied file will have a number added to its name.";
"_file_conflict_new_"       = "Uudet tiedostot";
"_file_conflict_exists_"    = "Jo olemassa olevat tiedostot";
"_file_not_rewite_doc_"     = "It is not possible to overwrite a document but only to create a new one.";
"_move_or_copy_"            = "Move or copy";
"_move_copy_diff_account_"  = "You cannot copy or move files between different accounts.";
"_copy_"                    = "Kopioi";
"_now_"                     = "Nyt";
"_wait_"                    = "Odota hetki…";
"_recent_"                  = "Viimeisimmät";
"_view_in_folder_"          = "Näe kansiossa";
"_leave_share_"             = "Poistu tästä jaosta";
"_disabled_"                = "Disabled";
"_compact_"                 = "Compact";
"_normal_"                  = "Normal";
"_verbose_"                 = "Verbose";
"_standard_"                = "Standard";
"_maximum_"                 = "Maximum";
"_error_occurred_"          = "An error occurred, please try again.";
"_retry_"                   = "Yritä uudelleen";
"_images_"                  = "Images";
"_confirm_"                 = "Vahvista";
"_confirm_continue_"        = "Confirm by continuing the previous uploading";
"_confirm_resetting_"       = "Confirm ignoring previous uploading";
"_background_location_access_title_"    = "Background Location Access";
"_background_location_access_message_"  = "This app needs background location access to automatically upload files when you move between areas. GPS is not used and your location is never stored.";
"_enable_background_location_title_"    = "Enable Background Location";
"_enable_background_location_message_"  = "To allow automatic file uploads in the background, please enable 'Always' for location access in Settings.";
"_enable_background_location_footer_"   = "To keep your photo library up to date automatically, this app can use background location access.\nThis allows it to detect when you’re in a new area and check for new photos to upload.\nGPS is not used, and your location is never stored or tracked.";

/* MARK: Files lock */

"_lock_"                            = "Lukitus";
"_unlock_"                          = "Avaa lukitus";
"_lock_file_"                       = "Lukitse tiedosto";
"_unlock_file_"                     = "Vapauta tiedoston lukitus";
"_lock_selected_files_"             = "Lukitse tiedostot";
"_unlock_selected_files_"           = "Avaa tiedostojen lukitus";
"_locked_by_"                       = "Lukinnut %@";
"_file_locked_no_override_"         = "This file is locked. It cannot be overridden.";
"_lock_no_permissions_selected_"    = "Not allowed for some selected files or folders.";
"_remove_file_"             = "Poista tiedosto";
"_delete_file_"             = "Poista tiedosto";
"_delete_folder_"           = "Poista kansio";
"_size_"                    = "Koko";
"_set_user_status_"         = "Online-tila";
"_set_user_status_message_" = "Tilaviesti";
"_open_settings_"           = "Avaa asetukset";
"_settings_account_request_" = "Request account at startup";
"_alias_"                   = "Alias";
"_alias_placeholder_"       = "Write alias";
"_alias_footer_"            = "Give your accounts a descriptive name such as Home, Office, School…";
"_privacy_legal_"           = "Yksityisyys";
"_source_code_"             = "Lataa lähdekoodi";
"_account_select_"          = "Valitse käyttäjä";
"_account_select_to_add_"   = "Valitse lisättävä tili";
"_remove_local_account_"    = "Remove local account";
"_want_delete_account_"     = "Do you want to remove local account?";
"_prevent_http_redirection_"= "The redirection in HTTP is not permitted.";
"_single_file_conflict_title_" = "Tiedoston ristiriita";
"_multi_file_conflict_title_" = "%@ File conflicts";
"_replace_action_title_" = "Korvaa";
"_keep_both_action_title_" = "Pidä molemmat";
"_cancel_keep_existing_action_title_" = "Cancel and keep existing";
"_replace_all_action_title_" = "Korvaa kaikki";
"_keep_both_for_all_action_title_" = "Keep both for all";
"_more_action_title_" = "More Details";
"_wait_file_preparation_" = "Preparing file upload. Please wait …";
"_keep_active_for_upload_" = "Keep application active until upload is completed …";
"_keep_active_for_transfers_" = "Keep application active until the transfers are completed …";
"_wait_file_encryption_"  = "Please wait, encrypting file…";
"_passcode_counter_fail_" = "Too many failed attempts, please wait before reattempting.";
"_seconds_"               = "seconds";
"_change_lock_passcode_"  = "Change passcode";
"_lock_cannot_disable_mdm_" = "Disabling the passcode lock is not permitted by your configuration profile.";

// MARK: User Status

/* User status */
"_online_"                  = "Paikalla";

/* User status */
"_away_"                    = "Poissa";

/* User status */
"_dnd_"                     = "Älä häiritse";

/* User status */
"_dnd_description_"         = "Mykistä kaikki ilmoitukset";

/* User status */
"_invisible_"               = "Näkymätön";

/* User status */
"_invisible_description_"   = "Näytä olevan poissa";

/* User status */
"_busy_"                    = "Busy";

/* User status */
"_select_user_status_"      = "Set online status";
"_select_status_message_"      = "Set status message";
"_status_message_"          = "Tilaviesti";
"_status_message_placehorder_"  = "Mikä on tilatietosi?";
"_online_status_"           = "Online-tila";
"_set_status_message_"      = "Aseta tilaviesti";
"_clear_status_message_after_"  = "Clear status after";

/* User status */
"_select_option_"           = "Valitse valinta";
"_dont_clear_"              = "Älä tyhjennä";
"_15_minutes_"              = "15 minutes";
"_30_minutes_"              = "30 minuuttia";
"_an_hour_"                 = "tunti";
"_1_hour_"                  = "1 tunti";
"_4_hours_"                 = "4 tuntia";
"_day_"                     = "Tänään";
"_this_week_"               = "Tämä viikko";
"_days_"                    = "Päivää";
"_hours_"                   = "Tunnit";
"_minutes_"                 = "Minuutit";


"_network_not_available_"   = "Network unavailable.";
"_file_already_exists_"     = "Unable to complete the operation, a file with the same name exists.";
"_files_lock_error_"        = "There was an error changing the lock of this file.";
"_more_"                        = "Lisää";
"_notifications_"               = "Ilmoitukset";
"_quota_space_unlimited_"       = "Rajoittamaton";
"_quota_space_unknown_"         = "Tuntematon";
"_quota_using_"                 = "Käytössäsi on %@/%@";
"_acknowledgements_"            = "Vahvistukset";
"_settings_"                    = "Asetukset";
"_enter_password_"              = "Enter password …";
"_lock_"                        = "Lukitus";
"_lock_active_"                 = "Lukitus: päällä";
"_lock_not_active_"             = "Lukitus: pois päältä";
"_lock_protection_no_screen_"        = "Älä kysy käynnistyksen yhteydessä";
"_enable_touch_face_id_"        = "Ota Touch/Face ID käyttöön";
"_wifi_only_"                   = "Käytä vain Wi-Fi-yhteyttä";
"_settings_autoupload_"         = "Lähetä kuvia automaattisesti";
"_clear_cache_"                 = "Tyhjennä välimuisti";
"_clear_cache_footer_"          = "Tyhjennä ladatut ja yhteydettömän tilan tiedostot sovelluksesta";
"_exit_"                        = "Nollaa sovellus";
"_exit_footer_"                 = "Remove all accounts and local data from the app.";
"_want_exit_"                   = "Attention! Will be reset to initial state. Continue?";
"_want_delete_cache_"           = "Do you want to delete the cache (this also removes the transfers in progress)?";
"_add_account_"                 = "Lisää tili";
"_want_delete_"                 = "You will delete the following: ";
"_want_leave_share_"            = "You will leave the following shares: ";
"_no_delete_"                   = "Ei, älä poista";
"_yes_delete_"                  = "Kyllä, poista";
"_information_"                 = "Tiedot";
"_select_offline_warning_"      = "Making multiple files and folders available offline may take a while and use a lot of memory while doing so.";
"_advanced_"                    = "Lisäasetukset";
"_permissions_"                 = "Oikeudet";
"_custom_permissions_"          = "Custom permissions";
"_disable_files_app_"           = "Poista Tiedostot-sovelluksen integraatio käytöstä";
"_disable_files_app_footer_"    = "Do not permit the access of files via the iOS Files application.";
"_time_remaining_"              = "%@ jäljellä";
"_autoupload_"                      = "Lähetä kuvia/videoita automaattisesti";
"_autoupload_select_folder_"        = "Select the \"Auto upload\" folder";
"_autoupload_photos_"               = "Lähetä kuvia automaattisesti";
"_autoupload_videos_"               = "Lähetä videoita automaattisesti";
"_autoupload_favorites_"            = "Auto upload favorites only";
"_autoupload_description_"          = "Choose whether new photos or videos will be automatically uploaded to your account.";
"_autoupload_fullphotos_"           = "Lähetä koko kameran rulla";
"_start_autoupload_"                = "Turn on auto upload";
"_stop_autoupload_"                 = "Turn off auto upload";
"_autoupload_fullphotos_footer_"    = "Adjust the options above before uploading.";
"_autoupload_create_subfolder_"     = "Käytä alikansioita";
"_autoupload_create_subfolder_footer_"  = "Store photos in subfolders based on year, month or day.";
"_autoupload_subfolder_granularity_"    = "Subfolder Granularity";
"_filenamemask_"                        = "Muuta tiedostojen nimeämiskäytäntöä";
"_filenamemask_footer_"                 = "By default, when a file is uploaded, it automatically gets the following format: yy-mm-dd hh-mm-ss plus a 4-digit counter. If you do not like this format, you can change it here except for the final 4-digit counter, which cannot be omitted.";
"_autoupload_current_folder_"           = "Currently selected folder";
"_show_hidden_files_"           = "Näytä piilotetut tiedostot";
"_format_compatibility_"        = "Yhteensopivin";
"_format_compatibility_footer_" = "\"Most compatible\" will save photos as JPEG, if possible.";
"_privacy_"                     = "Yksityisyys";
"_privacy_footer_"              = "This app uses a service for the analysis of a crash. Your personal information is not sent with the report. If you want disable it, please change the setting \"Disable crash reporter\" to ON.";
"_crashservice_title_"          = "Poista kaatumisraportoija käytöstä";
"_crashservice_alert_"          = "This option requires a restart of the app to take effect.";
"_upload_mov_livephoto_"        = "Live Photo";
"_upload_mov_livephoto_footer_" = "\"Live Photo\" pyrkii tallentamaan valitun kuvan \"Live Photo\" muodossa, jos se on mahdollista.";
"_capabilities_"                = "Capabilities";
"_capabilities_footer_"         = "Display the packages used by the app if they are installed and available on the server.";
"_diagnostics_"                 = "Diagnostiikka";
"_diagnostics_footer_"          = "Changing log level requires a restart of the app to take effect";
"_view_log_"                    = "View log file";
"_clear_log_"                   = "Clear log file";
"_set_log_level_"               = "Set Log level";
"_log_file_clear_alert_"        = "Log file cleared \n successfully!";
"_connect_server_anyway_"       = "Haluatko silti yhdistää palvelimeen?";
"_server_is_trusted_"           = "Luotatko tähän palvelimeen?";
"_connection_error_"            = "Yhteysvirhe";
"_tsnet_node_starting_"         = "Connecting to Tailscale…";
"_tsnet_needs_auth_"            = "Waiting for device approval.";
"_tsnet_needs_retag_"           = "Waiting for network node re-tagging.";
"_tsnet_other_error_"           = "Connection error.";
"_login_url_"                   = "Palvelimen osoite https:// ...";
"_login_url_error_"             = "URL-virhe. Varmista palvelimen URL-osoite";
"_login_error_"                 = "Could not log in. Please try again later.";
"_favorites_"                   = "Suosikit";
"_favorite_short_"              = "Favorite";
"_tutorial_favorite_view_"      = "Suosikeiksi merkitsemäsi tiedostot ja kansiot näkyvät tässä";
"_tutorial_offline_view_"       = "Files copied here will be available offline.\n\nThey will be synchronized with your cloud.";
"_tutorial_groupfolders_view_"  = "No team folders yet";
"_more_"                        = "Lisää";
"_favorite_no_files_"           = "Ei vielä suosikkeja";
"_no_date_information_"                     = "No date information";
"_no_camera_information_"                   = "No camera information";
"_no_lens_information_"                     = "No lens information";
"_today_"                                   = "Tänään";
"_yesterday_"                               = "Eilen";
"_access_photo_not_enabled_"                = "Access to Photos is not enabled";
"_access_photo_not_enabled_msg_"            = "Please go to Settings → Apps → Nextcloud → Photos and enable Photo Library Access";
"_access_background_app_refresh_denied_"    = "\"Background App Refresh\" is denied. Please enable it in \"Settings\" otherwise, new photos or videos will not be detected when the application is in the background";
"_new_photos_starting_"                     = "Only photos or videos starting %@ will be uploaded.";
"_tutorial_photo_view_"                     = "Ei lähetettyjä kuvia tai videoita";
"_error_createsubfolders_upload_"           = "Virhe alikansioita luotaessa";
"_remove_photo_CameraRoll_"                 = "Remove from camera roll";
"_remove_photo_CameraRoll_desc_"            = "\"Remove from camera roll\" after uploads, a confirmation message will be displayed to delete the uploaded photos or videos from the camera roll. The deleted photos or videos will still be available in the iOS Photos Trash for 30 days.";
"_never_"                       = "ei koskaan";
"_less_a_minute_"               = "alle minuutti sitten";
"_a_minute_ago_"                = "minuutti sitten";
"_minutes_ago_"                 = "%d minuuttia sitten";
"_an_hour_ago_"                 = "tunti sitten";
"_hours_ago_"                   = "%d tuntia sitten";
"_a_day_ago_"                   = "päivä sitten";
"_days_ago_"                    = "%d päivää sitten";
"_forbidden_characters_"        = "Forbidden characters: %@";
"_cannot_send_mail_error_"      = "No account is set up, or wrong email address entered.";
"_open_url_error_"              = "Cannot open the URL for this action.";
"_media_"                       = "Media";
"_order_by_"                    = "Lajittelujärjestys";
"_name_"                        = "Name";
"_date_"                        = "Päiväys";
"_size_"                        = "Koko";
"_delete_selected_files_"       = "Poista tiedostoja";
"_remove_favorites_"            = "Poista suosikeista";
"_add_favorites_"               = "Favorite";
"_share_"                       = "Jaa";
"_remove_local_file_"           = "Remove locally";
"_folders_"                     = "kansiot";
"_folder_"                      = "kansio";
"_files_"                       = "Tiedostot";
"_file_"                        = "tiedosto";
"_no_file_pull_down_"           = "Lähetä tiedosto tai vedä alas päivittääksesi";
"_no_file_no_permission_to_create_" = "You don't have permission to create or upload files in this folder.";
"_limited_dimension_"           = "Enimmäiskoko saavutettu";
"_save_selected_files_"         = "Tallenna kuva galleriaan";
"_file_not_saved_cameraroll_"   = "Virhe: Tiedostoa ei tallennettu kuva-albumiin";
"_file_saved_cameraroll_"       = "Tiedosto tallennettu kuva-albumiin";
"_favorite_on_top_"             = "Sort favorite first";
"_directory_on_top_"            = "Sort folders before files";
"_show_description_"            = "Show folder description";
"_show_recommended_files_"      = "Show recommendations";
"_search_no_record_found_"      = "Ei tuloksia";
"_search_in_progress_"          = "Haetaan...";
"_search_instruction_"          = "Etsi tiedosto (vähintään 2 merkkiä)";
"_files_no_files_"              = "Täällä ei ole tiedostoja";
"_files_no_folders_"            = "Ei kansioita täällä";
"_request_in_progress_"         = "Pyyntö palvelimelle on meneillään…";
"_personal_files_only_"         = "Personal files only";

"audio"                         = "ÄÄNI";
"directory"                     = "KANSIOT";
"document"                      = "DOKUMENTIT";
"image"                         = "KUVAT";
"template"                      = "MALLIPOHJAT";
"video"                         = "VIDEO";

"_paste_file_"                  = "Liitä";
"_cancel_all_task_"             = "Peruuta kaikki siirrot";
"_status_wait_download_"        = "Odottaa lataamista";
"_status_downloading_"          = "Ladataan";
"_status_wait_upload_"          = "Waiting to upload";
"_status_wait_create_folder_"   = "Waiting to create the folder";
"_status_wait_delete_"          = "Waiting to delete";
"_status_wait_rename_"          = "Waiting to rename";
"_status_wait_favorite_"        = "Waiting to change favorite";
"_status_wait_copy_"            = "Waiting to copy";
"_status_wait_move_"            = "Waiting to move";
"_status_uploading_"            = "Lähetys";
"_status_upload_error_"         = "Error, waiting to upload";
"_select_media_folder_"         = "Set Media folder";
"_media_viewimage_show_"        = "Show only images";
"_media_viewvideo_show_"        = "Show only video";
"_media_show_all_"              = "Show both";
"_good_morning_"                = "Good morning";
"_good_day_"                    = "Hyvää päivää";
"_good_afternoon_"              = "Good afternoon";
"_good_evening_"                = "Good evening";
"_good_night_"                  = "Good night";
"_servers_"                     = "Servers";
"_select_server_"               = "Please select a server...";

// MARK: Share

"_share_link_"                  = "Jaa linkki";
"_share_link_name_"             = "Link name";
"_password_"                    = "Salasana";
"_share_password_"              = "Salasanasuojattu linkki";
"_date_"                        = "Päiväys";
"_user_sharee_footer_"          = "Kosketa muokataksesi oikeuksia";
"_enforce_password_protection_" = "Pakota salasanasuojaus";
"_shared_with_you_by_"          = "Jaettu sinulle käyttäjältä";
"_shareLinksearch_placeholder_" = "Name, email, or Federated Cloud ID …";
"_new_comment_"                 = "Uusi kommentti…";
"_edit_comment_"                = "Muokkaa kommenttia";
"_delete_comment_"              = "Poista kommentti";
"_share_read_only_"             = "Vain katselu";
"_share_editing_"               = "Can edit";
"_share_allow_upload_"          = "Salli lähetys ja muokkaus";
"_share_file_drop_"             = "File request";
"_share_secure_file_drop_"      = "Secure file drop (upload only)";
"_share_hide_download_"         = "Piilota lataus";
"_share_allowed_downloads_"     = "Allowed downloads";
"_share_limit_download_"        = "Limit downloads";
"_remaining_"                   = "%d jäljellä";
"_share_password_protect_"      = "Password protection";
"_share_expiration_date_"       = "Aseta vanhenemispäivä";
"_share_note_recipient_"        = "Huomio vastaanottajalle";
"_share_add_sharelink_"         = "Lisää toinen linkki";
"_share_can_read_"              = "Read";
"_share_can_reshare_"           = "Share";
"_share_can_create_"            = "Luo";
"_share_can_change_"            = "Muokkaa";
"_share_can_delete_"            = "Delete";
"_share_can_download_"          = "Allow download and sync";
"_share_unshare_"               = "Delete share";
"_share_internal_link_"         = "Sisäinen linkki";
"_share_internal_link_des_"     = "Only works for users with access to this file/folder.";
"_share_reshare_disabled_"      = "You are not allowed to reshare this file/folder.";
"_share_reshare_restricted_"    = "Note: You only have limited permission to reshare this file/folder.";
"_remote_"                      = "Etä";
"_remote_group_"                = "Remote group";
"_conversation_"                = "Conversation";

"_no_transfer_"                     = "Ei siirtoja";
"_no_transfer_sub_"                 = "Tältä laitteelta suoritetut lähetykset ja lataukset näkyvät tässä";
"_no_activity_footer_"              = "No more activities to load";
"_transfers_"                       = "Siirrot";
"_activity_"                        = "Toimet";
"_trash_file_not_found_"            = "It seems that the file is not in the Trash. Go to the Trash to update it and try again.";
"_list_shares_"                     = "Jaot";
"_list_shares_no_files_"            = "Ei mitään jaettua";
"_tutorial_list_shares_view_"       = "Jakamasi tiedostot ja kansiot näkyvät tässä";
"_offline_"                         = "Poissa";
"_upload_photos_videos_"            = "Lähetä kuvia tai vidoita";
"_upload_file_"                     = "Lähetä tiedosto";
"_create_nextcloudtext_document_"   = "Luo tekstidokumentti";
"_use_folder_auto_upload_"          = "Use the \"Auto upload\" folder as destination";
"_filename_"                        = "Tiedostonimi";
"_enter_filename_"                  = "Enter filename …";
"_default_preview_filename_footer_" = "Example preview of filename: IMG_0001.JPG";
"_filename_header_"                 = "Enter filename";
"_preview_filename_"                = "Example preview of filename. You can use the mask %@ for date/time.";
"_add_filenametype_"                = "Specify type in filename";
"_maintain_original_filename_"      = "Säilytä alkuperäinen tiedostonimi";
"_notifications_"                   = "Ilmoitukset";
"_untitled_"                        = "Untitled";
"_e2e_settings_title_"              = "Salaus";
"_e2e_settings_"                    = "Päästä päähän -salaus";
"_e2e_settings_start_"              = "Käynnistä päästä päähän -salaus";
"_e2e_settings_activated_"          = "Päästä päähän -salaus aktivoitu";
"_e2e_server_disabled_"             = "End-to-end encryption app disabled on server";
"_e2e_settings_view_passphrase_"    = "Kaikki 12 sanaa yhdessä on hyvin vahva salasana, jonka avulla pystyy katselemaan ja käyttämään salattuja tiedostoja. Ota ne talteen ja säilytä turvallisessa paikassa. Älä jätä pöydälle!";
"_e2e_settings_read_passphrase_"    = "Read passphrase";
"_e2e_settings_lock_not_active_"    = "Lock not active. Go to \"Settings\" and activate it.";
"_e2e_settings_the_passphrase_is_"  = "Tunnuslause on:";
"_e2e_passphrase_request_title_"    = "Pyydä tunnuslausetta";
"_e2e_passphrase_request_message_"  = "Insert the 12 words";
"_e2e_settings_remove_"             = "Poista salaus paikallisesti";
"_e2e_settings_remove_message_"     = "Confirm removal of encryption along with the passphrase.";
"_e2e_set_folder_encrypted_"        = "Salaa";
"_e2e_remove_folder_encrypted_"     = "Pura salaus";
"_e2e_file_encrypted_"              = "File encrypted";
"_e2e_goto_settings_for_enable_"    = "This is an encrypted directory, go to \"Settings\" and enable end-to-end encryption";
"_e2e_in_upload_"                   = "Upload in progress, please wait for all files to be transferred.";
"_scans_document_"                  = "Skannaa dokumentti";
"_scanned_images_"                  = "Skannatut kuvat";
"_scan_document_pdf_page_"          = "Sivu";
"_scan_label_document_zone_"        = "Tap or drag images down for document creation";
"_filter_document_"                 = "Document";
"_filter_original_"                 = "Alkuperäinen";
"_quality_image_title_"             = "Preview image quality";
"_file_creation_"                   = "File creation";
"_delete_all_scanned_images_"       = "Delete all scanned images";
"_text_recognition_"                = "Tekstintunnistus";
"_all_files_"                       = "All files";
"_personal_files_"                  = "Personal Files";

"_trash_view_"                      = "Poistetut tiedostot";
"_empty_trash_"                     = "Tyhjennä roskakori";
"_trash_no_trash_"                  = "Yhtään tiedostoa ei poistettu";
"_trash_no_trash_description_"      = "Voit palauttaa poistettuja tiedostoja täältä";
"_confirm_delete_selected_"         = "Are you sure you want to delete the selected items?";
"_manage_file_offline_"             = "Hallitse offline-tiedostoja";
"_set_available_offline_"           = "Aseta saataville offlinessa";
"_remove_available_offline_"        = "Poista saatavilta offlinessa";
"_create_new_document_"             = "Luo uusi asiakirja";
"_create_new_spreadsheet_"          = "Luo uusi taulukko";
"_create_new_presentation_"         = "Luo uusi esitys";
"_go_online_"                       = "Go online to see the document";
"_intro_1_title_"                   = "Pidä tietosi turvassa ja omassa hallinnassasi";
"_intro_2_title_"                   = "Turvallista yhteistyötä ja tiedostojen jakamista";
"_intro_3_title_"                   = "Easy-to-use web mail, calendaring & contacts";
"_intro_4_title_"                   = "Screen sharing, online meetings & web conferences";
"_log_in_"                          = "Kirjaudu";
"_sign_up_"                         = "Sign up with provider";
"_host_your_own_server"             = "Host your own server";
"_invalid_url_"                         = "Virheellinen palvelimen URL-osoite";
"_ssl_certificate_untrusted_"           = "The certificate for this server is invalid.";
"_ssl_certificate_changed_"             = "The certificate for this server seems to have changed.";
"_file_already_exists_"                 = "Unable to complete the operation, a file with the same name exists.";
"_error_files_upload_"                  = "Error uploading files.";
"_internal_generic_error_"              = "internal error.";
"_err_permission_microphone_"           = "Please allow Microphone usage from Settings.";
"_err_permission_photolibrary_"         = "Please allow Photos from Settings.";
"_qrcode_not_authorized_"   = "This app is not authorized to use the Back Camera.";
"_qrcode_not_supported_"    = "QR code not supported by the current device.";
"_create_voice_memo_"       = "Luo äänimuistio";
"_voice_memo_start_"        = "Napauta aloittaaksesi";
"_voice_memo_stop_"         = "Napauta pysäyttääksesi";
"Enter Passcode"            = "Syötä pääsykoodi";
"Enter a new passcode"      = "Syötä uusi pääsykoodi";
"Confirm new passcode"      = "Vahvista uusi pääsykoodi";
"_too_many_failed_passcode_attempts_error_" = "Too many failed passcode attempts. Please try again.";
"Passcodes didn't match. Try again." = "Passcodes didn't match. Try again.";
"Delete"                    = "Poista";
"Cancel"                    = "Peruuta";
"_certificate_details_"     = "Certificate Server details";
"_certificate_pn_details_"  = "Certificate Push Notification details";
"_certificate_view_"        = "Certificate Server";
"_certificate_pn_view_"     = "Certificate Push Notification";
"_save_as_scan_"            = "Save as scan";
"_save_changes_"            = "Save changes?";
"_modify_"                  = "Muokkaa";
"_overwrite_original_"      = "Overwrite original";
"_save_as_copy_"            = "Tallenna kopiona";
"_discard_changes_"         = "Discard changes";
"_message_disable_overwrite_livephoto_" = "This image is a Live Photo, overwrite will not be possible.";
"_discard_changes_info_"    = "Tekemäsi muutokset hylättiin.";
"_delete_files_desc_"       = "Delete files to free up space";
"_delete_old_files_"        = "Delete, in the cache, all files older than";
"_never_"                   = "ei koskaan";
"_1_year_"                  = "1 vuosi";
"_6_months_"                = "6 kuukautta";
"_3_months_"                = "3 kuukautta";
"_1_month_"                 = "1 kuukausi";
"_1_week_"                  = "1 viikko";
"_monthly_"                 = "Kuukausittain";
"_yearly_"                  = "Vuosittain";
"_daily_"                   = "Daily";
"_used_space_"              = "Used space:";
"_login_address_detail_"    = "The link to your %@ web interface when you open it in the browser.";
"_go_to_page_"              = "Siirry sivulle";
"_page_"                    = "Sivu";
"_this_document_has_%@_pages_"              = "Tässä asiakirjassa on %@ sivua";
"_invalid_page_"                            = "Virheellinen sivu";
"_the_entered_page_number_does_not_exist_"   = "The entered page number does not exist.";
"_error_something_wrong_"   = "Jokin meni vikaan";
"_try_download_full_resolution_"            = "Download full resolution image";
"_full_resolution_image_info_"            = "This may reveal more information about the photo.";
"_download_audio_"          = "Download the audio locally";
"_copied_path_"             = "Polku kopioitu";
"_privacy_screen_"          = "Hide content when app is inactive";
"_privacy_screen_footer_"   = "Hide the content in the app and show a splash screen when the app is inactive.";
"_in_"                      = "in";
"_enter_passphrase_"        = "Kirjoita tunnuslause (12 sanaa)";
"_show_more_results_"       = "⋯ Load more results";
"_waiting_for_"             = "Waiting for:";
"_reachable_wifi_"          = "network reachable via Wi-Fi or cable";
"_copy_passphrase_"         = "Kopioi tunnuslause";
"_ok_copy_passphrase_"      = "OK and copy passphrase";
"_select_color_"            = "Valitse väri";
"_change_color_"            = "Vaihda väriä";
"_description_dashboardwidget_" = "Having the Dashboard always at your fingertips has never been easier.";
"_description_fileswidget_" = "View your recent files and use the toolbar to speed up your operations.";
"_description_toolbarwidget_"   = "A toolbar to speed up your operations.";
"_title_lockscreenwidget_"  = "Status";
"_description_lockscreenwidget_"    = "Keep an eye on available space and recent activity";

"_keep_running_"            = "Keep the app running for a better user experience.";
"_apps_nextcloud_detect_"   = "Detected %@ apps";
"_add_existing_account_"    = "Other %@ Apps has been detected, do you want to add an existing account?";
"_status_in_progress_"      = "Status reading in progress …";
"_status_e2ee_on_server_"   = "The end-to-end encryption is already configured in the server but not yet enabled on this device.";
"_status_e2ee_not_setup_"   = "The end-to-end encryption is not yet configured on the server.";
"_status_e2ee_configured_"  = "The end-to-end encryption is correctly configured.";
"_e2ee_set_as_offline_"     = "Not allowed for encrypted files or folders.";
"_change_upload_filename_"  = "Do you want to save the file with a different name?";
"_save_file_as_"            = "Save file as %@";
"_password_ascii_"          = "The password cannot contain special characters.";
"_calendar_contacts_"       = "Kalenteri ja yhteystiedot";
"_mobile_config_"           = "Download the configuration profile";
"_calendar_contacts_footer_warning_"    = "Configuration profile can only be downloaded if Safari is set as default browser.";
"_calendar_contacts_footer_"    = "After downloading the profile you can install it from Settings.";
"_modify_image_desc_"       = "Tap on a file to modify or rename.";
"_message_disable_livephoto_" = "This image is a Live Photo, changing it will lose the Live Photo effect.";
"_enable_livephoto_"        = "Enable Live Photo";
"_disable_livephoto_"       = "Disable Live Photo";
"_undo_modify_"             = "Undo modifying";
"_rename_already_exists_"   = "A file with this name already exists.";
"_group_folders_"           = "Team folders";
"_play_from_files_"         = "Play movie from a file";
"_play_from_url_"           = "Play movie from URL";
"_valid_video_url_"         = "Insert a valid URL";
"_chunk_move_"              = "The sent file could not be reassembled, please check the server log.";
"_download_image_"          = "Download image";
"_download_video_"          = "Download video";
"_reset_wrong_passcode_"    = "Nollaa sovellus";
"_reset_wrong_passcode_option_" = "Reset application after 10 failed attempts";
"_reset_wrong_passcode_desc_" = "Enabling this will remove all accounts and local data after %d failed passcode entry attempts.";
"_deviceOwnerAuthentication_" = "The biometric sensor has been temporarily disabled due to multiple failed attempts. Enter the device passcode to re-enable the sensor.";
"_virus_detect_"            = "Virus detected. Upload cannot be completed!";
"_select_photos_"           = "Select photos";
"_selected_photo_"          = "selected photo";
"_selected_photos_"         = "selected photos";
"_delete_selected_photos_"  = "Delete selected photos";
"_media_square_"            = "Square grid";
"_media_ratio_"             = "Aspect ratio grid";
"_autoupload_notice_"       = "To ensure the proper functioning of this feature, it is necessary to enable Background App Refresh. Otherwise, new photos or videos will not be detected when the application is in the background.\n\nAdditionally, please note that the app will not be able to detect new photos and videos if it is manually terminated. When the app is in the background, data transfer may be slower, and new photos and/or videos will generally be detected every 10 minutes, depending on the device’s battery level.\n\nTo verify that the app is functioning correctly, you can use the log file available in Advanced settings.";
"_display_"                 = "Näyttötapa";
"_appearance_"              = "Appearance";
"_light_"                   = "Light";
"_dark_"                    = "Dark";
"_use_system_style_"        = "Use system style";
"_account_settings_"        = "Account settings";
"_users_"                   = "Käyttäjät";
"_users_footer_"            = "Allows you to select an account every time you open the app.";
"_while_charging_"          = "While charging";
"_keep_screen_awake_"       = "Keep screen awake\nwhile transferring files";
"_error_not_found_"         = "The requested resource could not be found";
"_error_conflict_"          = "The request could not be completed due to a conflict with the current state of the resource";
"_error_precondition_"      = "The server does not meet one of the preconditions of the requester";
"_downloading_"             = "Ladataan";
"_additional_options_"      = "Additional options";
"_unauthorizedFilesPasscode_" = "Files app cannot be used with an activated passcode";
"_disableFilesApp_"         = "Files app cannot be used because it is disabled";
"_widget_available_nc25_"   = "Widget only available starting with server version 25";
"_no_items_"                = "No items";
"_check_back_later_"        = "Tarkista myöhemmin uudelleen.";
"_no_data_available_"       = "No data available";
"_recent_activity_"         = "Recent activity";
"_maintenance_mode_"        = "The server is currently in maintenance mode, which may take a while.";
"_account_disabled_"        = "Account disabled";
"_user_"                    = "Käyttäjä";
"_add_subtitle_"            = "Add an external subtitle";
"_add_audio_"               = "Add an external audio";
"_upload_foreground_msg_"   = "Do not close %@ to complete the transfer …";
"_upload_background_msg_"   = "Files upload in progress …";
"_create_folder_error_"     = "An error has occurred while creating the folder:\n%@.\n\nPlease resolve the issue as soon as possible.\n\nAll uploads are suspended until the problem is resolved.\n";
"_creating_dir_progress_"   = "Creating directories in progress … keep the application active.";
"_creating_db_photo_progress_" = "Creating photo archive in progress … keep the application active.";
"_account_unauthorized_"    = "There was an issue authorizing the account %@. Please log in again.";
"_folder_offline_desc_"     = "Even without an internet connection, you can organize your folders, create files. Once you're back online, your pending actions will automatically sync.";
"_offline_not_allowed_"     = "This operation is not allowed in offline mode";
"_Upload_native_format_yes_"= "Upload in native format: yes";
"_Upload_native_format_no_" = "Upload in native format: no";
"_terms_of_service_"        = "Terms of service";
"_terms_accept_"            = "I acknowledge that I have read and agree to the above terms of service.";
"_terms_accepted_"          = "Terms accepted";
"_recommended_files_"       = "Recommended Files";
"_propagate_layout_"        = "Apply the following change to all subfolders";
"_version_mismatch_error_"  = "Version change: please open the main app to update the data.";
"_check_auto_upload_"       = "Automatic photo upload is currently disabled.\nWith Nextcloud iOS you can automatically back up your photos and keep them safe on your server.\nJust open Settings → Auto Upload, choose the options you prefer, and turn it on with the \"%@\" button.";
"_cancel_all_request_"      = "Are you sure you want to cancel all transfers?";
"_cancel_all_"              = "Cancel All";
"_dismiss_"                 = "Hylkää";
"_opt_in_pro_"              = "Optimization in progress …";
"_update_in_progress_"      = "Update in progress …";
"_delete_in_progress_"      = "Delete in progress …";
"_download_in_progress_"    = "Download in progress …";
"_upload_in_progress_"      = "Upload in progress …";
"_transfer_in_progress_"    = "Transfer in progress …"; 
"_in_waiting_"              = "In waiting";
"_in_progress_"             = "In progress";
"_in_error_"                = "In error";
"_retry_minutes_"           = "min left to retry";
"_retry_seconds_"           = "sec left to retry";
"_retry_soon_"              = "retrying soon …";
"_large_upload_tip_"        = "Large files require the app to remain open until the transfer is complete";
"_e2ee_upload_tip_"         = "End-to-end files require the app to remain open until the transfer is complete";
"_finalizing_wait_"         = "Waiting for finalization …";
"_in_this_folder_"          = "In this folder";

// Tip
"_tip_pdf_thumbnails_"      = "Swipe left from the right edge of the screen to show the thumbnails";
"_tip_accountrequest_"      = "Touch here to change account or to add a new one";
"_tip_addcopyimage_"        = "Long press to paste a copied image";
"_tip_open_mediadetail_"    = "Swipe up to show the details";
"_tip_autoupload_button_"   = "Configure the options as you prefer (folder, Wi-Fi, new content, subfolders) and tap ‘Turn on auto uploading’.\nYou can stop it at any time, adjust the settings, and enable it again.";

// MARK: Accessibility

// Accessibility, floating panel top element
"_cart_controller_"             = "Card controller";
"_accessibility_add_upload_"    = "Lisää ja lähetä";
"_dismiss_menu_"                = "Dismiss the menu";
"_show_profile_"                = "Näytä profiili";
// a11y: On/Off
"_on_"                          = "On";
// a11y: On/Off
"_off_"                         = "Pois";
"_list_"                        = "Lista";
"_icons_"                       = "Icons";

// MARK: Assistant
"_assistant_task_unknown_"       = "Unknown";
"_assistant_task_scheduled_"     = "Scheduled";
"_assistant_task_in_progress_"   = "In Progress";
"_assistant_task_completed_"     = "Completed";
"_assistant_task_failed_"        = "Failed";
"_input_"                        = "Input";
"_output_"                       = "Output";
"_task_details_"                 = "Task details";
"_assistant_"                    = "Avustaja";
"_new_task_"                     = "New %@ task";
"_no_tasks_"                     = "Hello there! What can I help you with today?";
"_create_task_subtitle_"         = "Use the + button to create a new task";
"_edit_task_"                    = "Edit %@ task";
"_no_types_"                     = "No provider found";
"_no_types_subtitle_"            = "AI Providers need to be installed to use the Assistant.";
"_assistant_ai_warning_"         = "Output shown here is generated by AI. Make sure to always double-check.";
"_no_chat_subtitle_"             = "Try sending a message to spark a conversation.";
"_retry_response_generation_"    = "Retry response generation";
"_conversations_"                = "Conversations";
"_new_conversation_"             = "Uusi keskustelu";
"_type_message_"                 = "Type a message...";
"_assistant_chat_"               = "Assistant Chat";
"_assistant_error_send_message_"  = "Could not send message. Please try again.";
"_assistant_error_load_messages_" = "Could not load messages. Please try again.";
"_assistant_error_generate_response_" = "Could not generate response. Please try again.";

// MARK: Client certificate
"_no_client_cert_found_"         = "The server is requesting a client certificate.";
"_no_client_cert_found_desc_"    = "Do you want to install a TLS client certificate? \n Note that the .p12 certificate must be installed on your device first by clicking on it and installing it as an Identitity Certificate Profile in Settings. The certificate MUST also have a password as that is a requirement by iOS.";
"_client_cert_enter_password_"   = "Enter the password for the chosen certificate";
"_client_cert_wrong_password_"   = "Sorry, you entered an invalid password.";

// MARK: Login poll
"_poll_desc_"                    = "Please complete the log in process in your browser.";

// MARK: File name validator (used by ScaleCloudKit, don't remove)
"_file_name_validator_error_ends_with_space_period_" = "Name must not contain spaces at the beginning or end.";
"_file_name_validator_error_reserved_name_" = "\"%@\" is a forbidden name.";
"_file_name_validator_error_forbidden_file_extension_" = "\".%@\" is a forbidden file extension.";
"_file_name_validator_error_invalid_character_" = "Name contains an invalid character: \"%@\".";
"_file_name_validator_error_space_" = "Name must not contain spaces at the beginning or end.";
"_file_name_new_extension_" = "Changing the extension might cause this file to open in a different application.";
"_file_name_empty_" = "File name cannot be empty.";
"_please_rename_file_" = "Please rename the file or folder.";
"hidden_file_name_warning" = "Name will result in a hidden file.";

"_camera_roll_" = "Kameran rulla";
"_destination_" = "Määränpää";
"_select_autoupload_albums_" = "Select albums";
"_upload_from_" = "Upload from";
"_multiple_albums_" = "Multiple albums";
"_smart_albums_" = "Smart albums";
"_albums_" = "Albums";
"_new_photos_only_" = "New photos only";
"_all_photos_" = "All photos";
"_back_up_new_photos_only_" = "Back up new photos/videos only";
"_auto_upload_all_photos_warning_title_" = "Are you sure you want to upload all photos?";
"_auto_upload_all_photos_warning_message_" = "This can take some time to process depending on the amount of photos.";
"_item_with_same_name_already_exists_" = "An item with the same name already exists.";

// MARK: Migration Multi Domains
"_preparing_migration_" = "Preparing migration …";
"_scanning_files_" = "Scanning files …";
"_moving_items_to_domain_" = "Moving items to correct domain …";
"_finishing_up_" = "Finishing up …";

// MARK: E2EE
"_e2ee_no_session_" = "End-to-end encryption error, no account for this session";
"_e2ee_no_dir_" = "End-to-end encryption error, cannot get directory";
"_e2ee_no_certificate_" = "End-to-end encryption error, cannot get certificate";
"_e2ee_no_generate_key_" = "End-to-end encryption error, cannot generate key";
"_e2ee_no_metadataKey_found_" = "End-to-end encryption error, cannot decrypt metadata key";
"_e2ee_no_user_found_" = "End-to-end encryption error, user not found";
"_e2ee_no_signature_found_" = "End-to-end encryption error, no signature found";
"_e2ee_counter_check_" = "End-to-end encryption error, the counter is lower than the previous one";
"_e2ee_signature_failed_" = "End-to-end encryption error, verify signature failed";
"_e2ee_enc_payload_" = "End-to-end encryption error, encrypt payload file";
"_e2ee_no_metadata_" = "End-to-end encryption error, cannot get metadata";
"_e2ee_filedrop_ciphertext_" = "End-to-end encryption error, filedrop ciphertext failed";
"_e2ee_key_ciphertext_" = "End-to-end encryption error, key ciphertext failed";
"_e2ee_key_no_checksums_found_" = "End-to-end encryption error, no checksums found";
"_e2ee_key_checksums_" = "End-to-end encryption error, key checksums failed";
"_e2ee_decode_metadata_" = "End-to-end encryption error, cannot decode metadata";
"_e2ee_no_lock_" = "End-to-end encryption error, unable to lock file";
"_e2ee_no_decrypt_metadata_" = "End-to-end encryption error, cannot decrypt metadata";
"_e2ee_no_enc_file_" = "End-to-end encryption error, cannot encrypt file";
"_e2ee_no_enc_key_" = "End-to-end encryption error, cannot get encoded key";
"_e2ee_no_match_checksum_" = "End-to-end encryption error, checksum does not match";
"_e2ee_create_folder_" = "End-to-end encryption directory creation in progress, please wait …";
"_e2ee_rename_file_" = "End-to-end encryption rename in progress, please wait …";
"_e2ee_encrypt_folder_" = "End-to-end encryption folder in progress, please wait …";
"_e2ee_setup_get_certificate_" = "Server did not return a certificate";
"_e2ee_setup_create_csr_" = "Unable to generate certificate signing request (CSR)";
"_e2ee_setup_sign_certificate_" = "Server did not return a certificate after signing request";
"_e2ee_setup_extract_publickey_" = "Public key mismatch between generated key and certificate";
"_e2ee_setup_get_privatekey_" = "Server did not return an encrypted private key";
"_e2ee_setup_passphrase_error_" = "The provided passphrase is incorrect";
"_e2ee_setup_get_publickey_" = "Server did not return an encrypted public key";
"_e2ee_setup_encript_privatekey_" = "Unable to encrypt the private key";
"_e2ee_setup_store_privatekey_" = "Private key generation returned no usable key";
"_e2ee_setup_verify_publickey_" = "Public key does not match the certificate";
"_e2ee_setup_generate_passphrase_" = "Unable to generate a passphrase";

"_sc_watched_folders_" = "Watched Download Folders";
"_sc_manage_watched_folders_" = "Manage Watched Folders";
"_sc_watched_folders_description_" = "Add folders from the Files app ...";
